app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT * FROM `admins`

  def edit
    @admin = Admin.find(params[:id])
---
SELECT * FROM `admins` WHERE (`admins`.`id` = 1) LIMIT 1