app/controllers/applicants_controller.rb

  def index
  	@program = Program.find(params[:program_id])
  	if admin_signed_in? || juror_signed_in?
	  	@user = juror_session
	  	@applicants = @program.applicants.all :order => "#{sort_column} #{sort_direction}"
---
SELECT * FROM "programs" WHERE ("programs"."id" = 1)
SELECT * FROM `applicants`

  def show
  	if admin_signed_in? || juror_signed_in?
	  	@user = juror_session
	  	@applicant = Applicant.find(params[:id])
---
SELECT * FROM `applicants` WHERE (`applicants`.`id` = 1)

  def new
  	@program = Program.find(params[:program_id])
---
SELECT * FROM `programs` WHERE (`programs`.`id` = 1)

  def create
  	@program = Program.find(params[:program_id])
  	@applicant = @program.applicants.build(params[:applicant])
    if @applicant.save
---
SELECT * FROM `programs` WHERE (`programs`.`id` = 1)
INSERT INTO "applicants" ("program_id", "address", "city", "zip", "created_at", "updated_at", "lastname", "firstname", "phone", "website", "email") VALUES(NULL, '3957 15th Ave.', 'Minneapolis', '55407', '2010-06-28 01:07:50', '2010-06-28 01:07:50', 'haeck', 'kla', '612-817-9431', 'http://klahaeck.com', 'kla.haeck@gmail.com')

  def edit
  	@applicant = Applicant.find(params[:id])
---
SELECT * FROM `applicants` WHERE (`applicants`.`id` = 4)

  def update
  	@applicant = Applicant.find(params[:id])
---
SELECT * FROM `applicants` WHERE (`applicants`.`id` = 4)

  def destroy
  	@applicant = Applicant.find(params[:id])
  	@program = Program.find(@applicant.program_id)

    @applicant.destroy
---
SELECT * FROM `applicants` WHERE (`applicants`.`id` = 1)
DELETE FROM `applicants` WHERE `id` = 1