app/controllers/applicants_controller.rb

SELECT * FROM `programs` WHERE (`programs`.`id` = 1)
---
  def edit
    @applicant = Applicant.find(params[:id])
  	@program = Program.find(@applicant.program_id)