app/controllers/programs_controller.rb

SELECT * FROM `programs`
---
  def index
    @programs = Program.all

SELECT * FROM `programs` WHERE (`programs`.`id` = 1)
---
  def show
    @program = Program.find(params[:id])

INSERT INTO "programs" ("logo_updated_at", "created_at", "title", "updated_at", "guidlines", "contact", "logo_file_name", "logo_content_type", "logo_file_size") VALUES(NULL, '2010-06-24 01:29:16', 'CSA', '2010-06-24 01:29:16', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est ', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est ', NULL, NULL, NULL)
---
  def create
    @program = Program.new(params[:program])
    if @program.save

SELECT * FROM `programs` WHERE (`programs`.`id` = 1)
---
  def edit
    @program = Program.find(params[:id])

SELECT * FROM "programs" WHERE ("programs"."id" = 1)
UPDATE "programs" SET "end" = '2010-06-28', "updated_at" = '2010-06-28 00:49:40', "start" = '2010-06-28', "description" = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est' WHERE "id" = 1
---
  def update
    @program = Program.find(params[:id])
    if @program.update_attributes(params[:program])

SELECT * FROM `programs` WHERE (`programs`.`url` = 'csa') LIMIT 1
---
  def named
    @program = Program.find_by_url(params[:url])

SELECT * FROM `programs` WHERE (`programs`.`url` = 'csa') LIMIT 1
---
  def guidelines
    @program = Program.find_by_url(params[:url])