app/controllers/submissions_controller.rb

SELECT * FROM `submissions`
---
  def index
    @submissions = Submission.all

SELECT * FROM `submissions` WHERE (`submissions`.`id` = 1)
---
  def show
    @submission = Submission.find(params[:id])

SELECT * FROM `applicants` WHERE (`applicants`.`id` = 17)
SELECT * FROM `programs` WHERE (`programs`.`id` = 1)
---
  def new
  	@applicant = Applicant.find(params[:applicant_id])
  	@program = Program.find(@applicant.program_id)

SELECT * FROM `applicants` WHERE (`applicants`.`id` = 19)
SELECT * FROM `programs` WHERE (`programs`.`id` = 1)
INSERT INTO `submissions` (`created_at`, `applicant_id`, `updated_at`, `statement`) VALUES('2010-07-11 23:25:40', NULL, '2010-07-11 23:25:40', 'asdfasdf')
---
  def create
    @submission = Submission.new(params[:submission])
    @applicant = Applicant.find(@submission.applicant_id)
  	@program = Program.find(@applicant.program_id)
    if @submission.save