app/controllers/types_controller.rb

  def index
    @types = Type.all
---
SELECT * FROM "types"

  def show
    @type = Type.find(params[:id])
---
SELECT * FROM "types" WHERE ("types"."id" = 1)

  def create
    @type = Type.new(params[:type])
    if @type.save
---
INSERT INTO "types" ("created_at", "title", "updated_at") VALUES('2010-06-24 02:06:03', 'Visual Arts', '2010-06-24 02:06:03')

  def edit
    @type = Type.find(params[:id])
---
SELECT * FROM "types" WHERE ("types"."id" = 3)

  def update
    @type = Type.find(params[:id])
    if @type.update_attributes(params[:type])
---
SELECT * FROM "types" WHERE ("types"."id" = 3)
UPDATE "types" SET "updated_at" = '2010-06-24 02:06:32', "title" = 'Performance/Video' WHERE "id" = 3