app/controllers/works_controller.rb

  def index
    @works = Work.all
---
SELECT * FROM `works`